# FabricLocation Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
FabricSheet..::..FabricLocation Property
FabricSheet Class See Also
---
The Fabric Sheet location in the host.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2015
# Syntax
C#
---
```text
public FabricLocation FabricLocation { get; set; }
```

Visual Basic
---
```text
Public Property FabricLocation As FabricLocation
	Get
	Set
```

Visual C++
---
```text
public:
property FabricLocation FabricLocation {
	FabricLocation get ();
	void set (FabricLocation value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: |

# See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace